# ElementId Properties

---
The ElementId type exposes the following members.
| Name| Description
---|---|---
| InvalidElementId|  Get the invalid ElementId whose value is -1.
| Value|  Provides the value of the element id as a 64-bit integer.
Top
#### Reference
ElementId Class
Autodesk.Revit.DB Namespace